数据重构

In [7]:
import numpy as np
import pandas as pd

text = pd.read_csv('/Users/ousei/Documents/数据分析/Datawhale/hands-on-eda/阿日的笔记/data/train-left-up.csv')
text.head()

   PassengerId  ...                                               Name
0            1  ...                            Braund, Mr. Owen Harris
1            2  ...  Cumings, Mrs. John Bradley (Florence Briggs Th...
2            3  ...                             Heikkinen, Miss. Laina
3            4  ...       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4            5  ...                           Allen, Mr. William Henry

[5 rows x 4 columns]

In [8]:
#数据的合并

#观察几个数据
text_left_up = pd.read_csv("data/train-left-up.csv")
text_left_down = pd.read_csv("data/train-left-down.csv")
text_right_up = pd.read_csv("data/train-right-up.csv")
text_right_down = pd.read_csv("data/train-right-down.csv")

In [9]:
text_left_up.head()

   PassengerId  ...                                               Name
0            1  ...                            Braund, Mr. Owen Harris
1            2  ...  Cumings, Mrs. John Bradley (Florence Briggs Th...
2            3  ...                             Heikkinen, Miss. Laina
3            4  ...       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4            5  ...                           Allen, Mr. William Henry

[5 rows x 4 columns]

In [11]:
text_left_down.head()

   PassengerId  Survived  Pclass                                         Name
0          440         0       2       Kvillner, Mr. Johan Henrik Johannesson
1          441         1       2  Hart, Mrs. Benjamin (Esther Ada Bloomfield)
2          442         0       3                              Hampe, Mr. Leon
3          443         0       3                    Petterson, Mr. Johan Emil
4          444         1       2                    Reynaldo, Ms. Encarnacion

In [12]:
text_right_up.head()

      Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0    male  22.0    1.0    0.0         A/5 21171   7.2500   NaN        S
1  female  38.0    1.0    0.0          PC 17599  71.2833   C85        C
2  female  26.0    0.0    0.0  STON/O2. 3101282   7.9250   NaN        S
3  female  35.0    1.0    0.0            113803  53.1000  C123        S
4    male  35.0    0.0    0.0            373450   8.0500   NaN        S

In [13]:
text_right_down.head()

      Sex   Age  SibSp  Parch        Ticket    Fare Cabin Embarked
0    male  31.0      0      0    C.A. 18723  10.500   NaN        S
1  female  45.0      1      1  F.C.C. 13529  26.250   NaN        S
2    male  20.0      0      0        345769   9.500   NaN        S
3    male  25.0      1      0        347076   7.775   NaN        S
4  female  28.0      0      0        230434  13.000   NaN        S

In [16]:
#合并up
list_up = [text_left_up,text_right_up]
result_up = pd.concat(list_up,axis=1)
result_up.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0          1.0       0.0     3.0  ...   7.2500   NaN         S
1          2.0       1.0     1.0  ...  71.2833   C85         C
2          3.0       1.0     3.0  ...   7.9250   NaN         S
3          4.0       1.0     1.0  ...  53.1000  C123         S
4          5.0       0.0     3.0  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [17]:
#横向合并down
list_down = [text_left_down,text_right_down]
result_down = pd.concat(list_down,axis=1)
result_down.head()

   PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
0          440         0       2  ...  10.500   NaN         S
1          441         1       2  ...  26.250   NaN         S
2          442         0       3  ...   9.500   NaN         S
3          443         0       3  ...   7.775   NaN         S
4          444         1       2  ...  13.000   NaN         S

[5 rows x 12 columns]

In [20]:
#纵向合并up和down
list_result = [result_up,result_down]
result = pd.concat(list_result)
result.head(-5)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1.0       0.0     3.0  ...   7.2500   NaN         S
1            2.0       1.0     1.0  ...  71.2833   C85         C
2            3.0       1.0     3.0  ...   7.9250   NaN         S
3            4.0       1.0     1.0  ...  53.1000  C123         S
4            5.0       0.0     3.0  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
442        882.0       0.0     3.0  ...   7.8958   NaN         S
443        883.0       0.0     3.0  ...  10.5167   NaN         S
444        884.0       0.0     2.0  ...  10.5000   NaN         S
445        885.0       0.0     3.0  ...   7.0500   NaN         S
446        886.0       0.0     3.0  ...  29.1250   NaN         Q

[1338 rows x 12 columns]

In [22]:
#使用DataFrame自带的方法join方法和append,完成合并
result_up = text_left_up.join(text_right_up)
result_up.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [23]:
result_down = text_left_down.join(text_right_down)
result_down.head()

   PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
0          440         0       2  ...  10.500   NaN         S
1          441         1       2  ...  26.250   NaN         S
2          442         0       3  ...   9.500   NaN         S
3          443         0       3  ...   7.775   NaN         S
4          444         1       2  ...  13.000   NaN         S

[5 rows x 12 columns]

In [25]:
result = result_up.append(result_down)
result.head(-5)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
442          882         0       3  ...   7.8958   NaN         S
443          883         0       3  ...  10.5167   NaN         S
444          884         0       2  ...  10.5000   NaN         S
445          885         0       3  ...   7.0500   NaN         S
446          886         0       3  ...  29.1250   NaN         Q

[886 rows x 12 columns]

In [27]:
#使用Panads的merge方法和DataFrame的append方法
result_up = pd.merge(text_left_up,text_right_up,left_index=True,right_index=True)
result_down = pd.merge(text_left_down,text_right_down,left_index=True,right_index=True)
result = result_up.append(result_down)
result.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

1、当没有索引时：merge、join为按照一定条件合并

2、当有索引、并按照索引合并时，得到结果为两者混合到一起了，重新按照一定规则排序了。

3、当没有索引时、concat不管列名，直接加到一起，可以加到后面、也可以加到右边，axis=0为加到后面，axis=1为加到右边，左边的数据结构没有变，变的是右边数据结构。

4、当有索引、并按照索引合并时，得到结果两者混合到一起了

从合并的方式看merge和join是一样的，有left/right/inner/outer，而concat只有inner/outer两种，因为merge和join参与合并的对象有左右区分，而concat第一个参数是多个dataframe组成的列表，没有严格的左右区分，如果排除最后结果中列的顺序的话，可以看成是一样的.

merge合并的范围最广泛，可以合并左边对象的索引/列和右边对象的索引/列的四种组合；join次之，仅可以实现调用DataFrame的索引/列和参数DataFrame的索引的合并，也就是参数DataFrame的列不能参与合并；concat合并的范围最小，只支持索引的合并，也就是说索引与索引的合并是三个函数共同的功能.

concat和join的共同点是可以合并3个以上的对象，merge只合并两个对象

In [28]:
result.to_csv('result.csv')

In [29]:
#将数据变为Series类型的数据,Stack函数
text = pd.read_csv('result.csv')
text.head()
unit_result=text.stack().head(20)
unit_result.head()

0  Unnamed: 0                           0
   PassengerId                          1
   Survived                             0
   Pclass                               3
   Name           Braund, Mr. Owen Harris
dtype: object

In [30]:
#将代码保存为unit_result,csv
unit_result.to_csv('unit_result.csv')
test = pd.read_csv('unit_result.csv')
test.head()

   0   Unnamed: 0                      0.1
0  0  PassengerId                        1
1  0     Survived                        0
2  0       Pclass                        3
3  0         Name  Braund, Mr. Owen Harris
4  0          Sex                     male